
#Область ПрограммныйИнтерфейс

// Формирует структуру параметров алгоритма метрики.
//
// Параметры:
//	Ссылка - СправочникСсылка.пэмМетрики - метрика.
//
// Возвращаемое значение:
//	Структура - содержит параметры алгоритма метрики.
Функция ПараметрыАлгоритмаМетрики(Ссылка) Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.ИмяПараметра КАК ИмяПараметра,
	|	Т.Значение КАК Значение
	|ИЗ
	|	Справочник.пэмМетрики.ПараметрыАлгоритма КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗаписей   = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		Результат.Вставить(ВыборкаЗаписей.ИмяПараметра, ВыборкаЗаписей.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти