#Область ОбработчикиСобытий

Функция PollingGet(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МетрикиСтрокой = пэмМетрикиСервер.СформироватьМетрикиПоЗапросу();

	Если НЕ ЗначениеЗаполнено(МетрикиСтрокой) Тогда
		
		Возврат Новый HTTPСервисОтвет(КодыСостоянияHTTPКлиентСерверПовтИсп.НайтиКодПоИдентификатору("NO_CONTENT"));
		
	КонецЕсли; 
	
	Ответ = Новый HTTPСервисОтвет(КодыСостоянияHTTPКлиентСерверПовтИсп.НайтиКодПоИдентификатору("OK"));
	Ответ.УстановитьТелоИзСтроки(МетрикиСтрокой, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;

КонецФункции

#КонецОбласти